jyyy3901/GD32_HAL_Compat/Port/gd32_hal_port.h
#ifndef GD32_HAL_PORT_H
#define GD32_HAL_PORT_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_hal_conf.h"
#include "gd32f403.h"
#include <stdint.h>

/*
 * 本文件是兼容 API 与 GD32 SPL 之间唯一允许直接暴露厂商定义的边界。
 * 上层 HAL 文件不得依赖 GD32 寄存器布局。
 */

#define GD32_HAL_GPIOA_ADDRESS ((uint32_t)(GPIO_BASE + 0x00000000U))
#define GD32_HAL_GPIOB_ADDRESS ((uint32_t)(GPIO_BASE + 0x00000400U))
#define GD32_HAL_GPIOC_ADDRESS ((uint32_t)(GPIO_BASE + 0x00000800U))
#define GD32_HAL_GPIOD_ADDRESS ((uint32_t)(GPIO_BASE + 0x00000C00U))

#define GD32_HAL_USART0_ADDRESS 0x40013800UL
#define GD32_HAL_USART1_ADDRESS 0x40004400UL
#define GD32_HAL_USART2_ADDRESS 0x40004800UL
#define GD32_HAL_UART3_ADDRESS  0x40004C00UL
#define GD32_HAL_UART4_ADDRESS  0x40005000UL

#define GD32_HAL_TIMER0_ADDRESS  0x40012C00UL
#define GD32_HAL_TIMER1_ADDRESS  0x40000000UL
#define GD32_HAL_TIMER2_ADDRESS  0x40000400UL
#define GD32_HAL_TIMER3_ADDRESS  0x40000800UL
#define GD32_HAL_TIMER4_ADDRESS  0x40000C00UL
#define GD32_HAL_TIMER5_ADDRESS  0x40001000UL
#define GD32_HAL_TIMER6_ADDRESS  0x40001400UL
#define GD32_HAL_TIMER7_ADDRESS  0x40013400UL
#define GD32_HAL_TIMER8_ADDRESS  0x40014C00UL
#define GD32_HAL_TIMER9_ADDRESS  0x40015000UL
#define GD32_HAL_TIMER10_ADDRESS 0x40015400UL
#define GD32_HAL_TIMER11_ADDRESS 0x40001800UL
#define GD32_HAL_TIMER12_ADDRESS 0x40001C00UL
#define GD32_HAL_TIMER13_ADDRESS 0x40002000UL

#define GD32_HAL_ADC0_ADDRESS 0x40012400UL

#define GD32_HAL_I2C0_ADDRESS 0x40005400UL
#define GD32_HAL_I2C1_ADDRESS 0x40005800UL

#define GD32_HAL_SPI0_ADDRESS 0x40013800UL
#define GD32_HAL_SPI1_ADDRESS 0x40003800UL
#define GD32_HAL_SPI2_ADDRESS 0x40003C00UL

#define GD32_HAL_DMA0_ADDRESS 0x40020000UL
#define GD32_HAL_DMA1_ADDRESS 0x40020400UL
#define GD32_HAL_DMA_CHANNEL_ADDRESS(DMA_ADDRESS, CHANNEL) \
    ((uint32_t)((DMA_ADDRESS) + 0x08UL + (0x14UL * (uint32_t)(CHANNEL))))
#define GD32_HAL_DMA0_CHANNEL0_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 0U)
#define GD32_HAL_DMA0_CHANNEL1_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 1U)
#define GD32_HAL_DMA0_CHANNEL2_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 2U)
#define GD32_HAL_DMA0_CHANNEL3_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 3U)
#define GD32_HAL_DMA0_CHANNEL4_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 4U)
#define GD32_HAL_DMA0_CHANNEL5_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 5U)
#define GD32_HAL_DMA0_CHANNEL6_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA0_ADDRESS, 6U)
#define GD32_HAL_DMA1_CHANNEL0_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA1_ADDRESS, 0U)
#define GD32_HAL_DMA1_CHANNEL1_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA1_ADDRESS, 1U)
#define GD32_HAL_DMA1_CHANNEL2_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA1_ADDRESS, 2U)
#define GD32_HAL_DMA1_CHANNEL3_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA1_ADDRESS, 3U)
#define GD32_HAL_DMA1_CHANNEL4_ADDRESS GD32_HAL_DMA_CHANNEL_ADDRESS(GD32_HAL_DMA1_ADDRESS, 4U)

#define GD32_HAL_DMA_REQUEST_MEMORY 0U
#define GD32_HAL_DMA_REQUEST_ENCODE(CONTROLLER, CHANNEL, SLOT) \
    (0x80000000UL | ((uint32_t)(CONTROLLER) << 16U) | \
     ((uint32_t)(CHANNEL) << 8U) | ((uint32_t)(SLOT) + 1U))

/* 先保存 GD32 IRQ 数值，供公共头文件安全覆盖 STM32 风格名称。 */
enum
{
    GD32_HAL_USART0_IRQn_VALUE = USART0_IRQn,
    GD32_HAL_USART1_IRQn_VALUE = USART1_IRQn,
    GD32_HAL_USART2_IRQn_VALUE = USART2_IRQn,
    GD32_HAL_UART3_IRQn_VALUE = UART3_IRQn,
    GD32_HAL_UART4_IRQn_VALUE = UART4_IRQn
};

enum
{
    GD32_HAL_TIMER0_BRK_TIMER8_IRQn_VALUE = TIMER0_BRK_TIMER8_IRQn,
    GD32_HAL_TIMER0_UP_TIMER9_IRQn_VALUE = TIMER0_UP_TIMER9_IRQn,
    GD32_HAL_TIMER0_TRG_CMT_TIMER10_IRQn_VALUE = TIMER0_TRG_CMT_TIMER10_IRQn,
    GD32_HAL_TIMER0_CHANNEL_IRQn_VALUE = TIMER0_Channel_IRQn,
    GD32_HAL_TIMER1_IRQn_VALUE = TIMER1_IRQn,
    GD32_HAL_TIMER2_IRQn_VALUE = TIMER2_IRQn,
    GD32_HAL_TIMER3_IRQn_VALUE = TIMER3_IRQn,
    GD32_HAL_TIMER7_BRK_TIMER11_IRQn_VALUE = TIMER7_BRK_TIMER11_IRQn,
    GD32_HAL_TIMER7_UP_TIMER12_IRQn_VALUE = TIMER7_UP_TIMER12_IRQn,
    GD32_HAL_TIMER7_TRG_CMT_TIMER13_IRQn_VALUE = TIMER7_TRG_CMT_TIMER13_IRQn,
    GD32_HAL_TIMER7_CHANNEL_IRQn_VALUE = TIMER7_Channel_IRQn,
    GD32_HAL_TIMER4_IRQn_VALUE = TIMER4_IRQn,
    GD32_HAL_TIMER5_IRQn_VALUE = TIMER5_IRQn,
    GD32_HAL_TIMER6_IRQn_VALUE = TIMER6_IRQn
};

enum
{
    GD32_HAL_ADC0_1_IRQn_VALUE = ADC0_1_IRQn
};

enum
{
    GD32_HAL_I2C0_EV_IRQn_VALUE = I2C0_EV_IRQn,
    GD32_HAL_I2C0_ER_IRQn_VALUE = I2C0_ER_IRQn,
    GD32_HAL_I2C1_EV_IRQn_VALUE = I2C1_EV_IRQn,
    GD32_HAL_I2C1_ER_IRQn_VALUE = I2C1_ER_IRQn,
    GD32_HAL_SPI0_IRQn_VALUE = SPI0_IRQn,
    GD32_HAL_SPI1_IRQn_VALUE = SPI1_IRQn,
    GD32_HAL_SPI2_IRQn_VALUE = SPI2_IRQn
};

typedef enum
{
    GD32_HAL_GPIO_MODE_ANALOG = 0,
    GD32_HAL_GPIO_MODE_INPUT_FLOATING,
    GD32_HAL_GPIO_MODE_INPUT_PULLUP,
    GD32_HAL_GPIO_MODE_INPUT_PULLDOWN,
    GD32_HAL_GPIO_MODE_OUTPUT_PP,
    GD32_HAL_GPIO_MODE_OUTPUT_OD,
    GD32_HAL_GPIO_MODE_AF_PP,
    GD32_HAL_GPIO_MODE_AF_OD
} GD32_HAL_GPIOMode;

typedef enum
{
    GD32_HAL_GPIO_SPEED_2MHZ = 0,
    GD32_HAL_GPIO_SPEED_10MHZ,
    GD32_HAL_GPIO_SPEED_50MHZ,
    GD32_HAL_GPIO_SPEED_MAX
} GD32_HAL_GPIOSpeed;

typedef enum
{
    GD32_HAL_EXTI_INTERRUPT = 0,
    GD32_HAL_EXTI_EVENT
} GD32_HAL_EXTIMode;

typedef enum
{
    GD32_HAL_EXTI_RISING = 0,
    GD32_HAL_EXTI_FALLING,
    GD32_HAL_EXTI_BOTH
} GD32_HAL_EXTITrigger;

typedef enum
{
    GD32_HAL_RCC_CLOCK_SYS = 0,
    GD32_HAL_RCC_CLOCK_AHB,
    GD32_HAL_RCC_CLOCK_APB1,
    GD32_HAL_RCC_CLOCK_APB2
} GD32_HAL_RCCClock;

typedef enum
{
    GD32_HAL_RCC_SOURCE_IRC8M = 0,
    GD32_HAL_RCC_SOURCE_HXTAL,
    GD32_HAL_RCC_SOURCE_PLL
} GD32_HAL_RCCSource;

#define GD32_HAL_RCC_HXTAL_OFF 0U
#define GD32_HAL_RCC_HXTAL_ON 1U
#define GD32_HAL_RCC_HXTAL_BYPASS 2U
#define GD32_HAL_RCC_OSC_IRC8M_ON (1UL << 0U)
#define GD32_HAL_RCC_OSC_HXTAL_ON (1UL << 1U)
#define GD32_HAL_RCC_OSC_HXTAL_BYPASS (1UL << 2U)
#define GD32_HAL_RCC_OSC_PLL_ON (1UL << 3U)

