jyyy3901/GD32_HAL_Compat/Port/gd32_hal_port.h
typedef enum
{
    GD32_HAL_FLASH_READY = 0,
    GD32_HAL_FLASH_BUSY,
    GD32_HAL_FLASH_PROGRAM_ERROR,
    GD32_HAL_FLASH_WRITE_PROTECT_ERROR,
    GD32_HAL_FLASH_TIMEOUT
} GD32_HAL_FLASHStatus;

typedef enum
{
    GD32_HAL_FLASH_IT_NONE = 0U,
    GD32_HAL_FLASH_IT_END = (1UL << 0U),
    GD32_HAL_FLASH_IT_PROGRAM_ERROR = (1UL << 1U),
    GD32_HAL_FLASH_IT_WRITE_PROTECT_ERROR = (1UL << 2U)
} GD32_HAL_FLASHInterrupt;

typedef enum
{
    GD32_HAL_PORT_ERROR_NONE = 0,
    GD32_HAL_PORT_ERROR_INVALID_INSTANCE,
    GD32_HAL_PORT_ERROR_INVALID_PIN,
    GD32_HAL_PORT_ERROR_OUTPUT_PULL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_AF_SELECTION_REQUIRES_NATIVE_INIT,
    GD32_HAL_PORT_ERROR_TICK_RELOAD,
    GD32_HAL_PORT_ERROR_UART_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_UART_OVERSAMPLING_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_FLOW_CONTROL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_BAUD_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_DMA_PHASE_REQUIRED,
    GD32_HAL_PORT_ERROR_UART_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_UART_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_UART_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_DMA_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_CONFIG,
    GD32_HAL_PORT_ERROR_DMA_REQUEST_MISMATCH,
    GD32_HAL_PORT_ERROR_DMA_CHANNEL_CONFLICT,
    GD32_HAL_PORT_ERROR_DMA_UNSUPPORTED_FLAG,
    GD32_HAL_PORT_ERROR_TIMER_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE,
    GD32_HAL_PORT_ERROR_TIMER_COUNTER_MODE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_CHANNEL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_REPETITION_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_MASTER_SLAVE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_ITR_UNMAPPABLE,
    GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_TIMER_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_TIMER_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_ADC_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_ADC_CLOCK_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_TRIGGER_EDGE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_TRIGGER_UNMAPPABLE,
    GD32_HAL_PORT_ERROR_ADC_SAMPLE_TIME_UNMAPPABLE,
    GD32_HAL_PORT_ERROR_ADC_CHANNEL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_EOC_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_ADC_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_ADC_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_ADC_OVERRUN_UNAVAILABLE,
    GD32_HAL_PORT_ERROR_I2C_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_I2C_TIMEOUT,
    GD32_HAL_PORT_ERROR_I2C_DMA_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_SPI_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_SPI_DMA_LINK_INVALID,
    GD32_HAL_PORT_ERROR_SPI_DMA_CONFIG_MISMATCH,
    GD32_HAL_PORT_ERROR_SPI_TIMEOUT,
    GD32_HAL_PORT_ERROR_RCC_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_RCC_PLL_MODEL_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_RCC_CLOCK_LIMIT,
    GD32_HAL_PORT_ERROR_EXTI_INVALID_CONFIG,
    GD32_HAL_PORT_ERROR_FLASH_INVALID_RANGE,
    GD32_HAL_PORT_ERROR_FLASH_WRITABLE_REGION_REQUIRED,
    GD32_HAL_PORT_ERROR_FLASH_PROGRAM_TYPE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_FLASH_MASS_ERASE_UNSUPPORTED,
    GD32_HAL_PORT_ERROR_FLASH_OPERATION
} GD32_HAL_PortError;

typedef enum
{
    GD32_HAL_I2C_FLAG_START = (1UL << 0U),
    GD32_HAL_I2C_FLAG_ADDRESS = (1UL << 1U),
    GD32_HAL_I2C_FLAG_BYTE_TRANSFER = (1UL << 2U),
    GD32_HAL_I2C_FLAG_ADDRESS10 = (1UL << 3U),
    GD32_HAL_I2C_FLAG_RX_NOT_EMPTY = (1UL << 4U),
    GD32_HAL_I2C_FLAG_TX_EMPTY = (1UL << 5U),
    GD32_HAL_I2C_FLAG_BUSY = (1UL << 6U)
} GD32_HAL_I2CFlag;

#define GD32_HAL_I2C_ERROR_BUS         (1UL << 0U)
#define GD32_HAL_I2C_ERROR_ARBITRATION (1UL << 1U)
#define GD32_HAL_I2C_ERROR_ACK         (1UL << 2U)
#define GD32_HAL_I2C_ERROR_OVERRUN     (1UL << 3U)
#define GD32_HAL_I2C_ERROR_PEC         (1UL << 4U)
#define GD32_HAL_I2C_ERROR_TIMEOUT     (1UL << 5U)

#define GD32_HAL_I2C_INTERRUPT_ERROR (1UL << 0U)
#define GD32_HAL_I2C_INTERRUPT_EVENT (1UL << 1U)
#define GD32_HAL_I2C_INTERRUPT_BUFFER (1UL << 2U)

typedef struct
{
    uint32_t clock_speed;
    uint16_t own_address1;
    uint16_t own_address2;
    uint8_t duty_16_9;
    uint8_t address_10bit;
    uint8_t dual_address;
    uint8_t general_call;
    uint8_t no_stretch;
} GD32_HAL_I2CConfig;

typedef enum
{
    GD32_HAL_SPI_FLAG_RX_NOT_EMPTY = (1UL << 0U),
    GD32_HAL_SPI_FLAG_TX_EMPTY = (1UL << 1U),
    GD32_HAL_SPI_FLAG_BUSY = (1UL << 2U)
} GD32_HAL_SPIFlag;

#define GD32_HAL_SPI_ERROR_MODE    (1UL << 0U)
#define GD32_HAL_SPI_ERROR_CRC     (1UL << 1U)
#define GD32_HAL_SPI_ERROR_OVERRUN (1UL << 2U)
#define GD32_HAL_SPI_ERROR_FRAME   (1UL << 3U)

#define GD32_HAL_SPI_INTERRUPT_TX    (1UL << 0U)
#define GD32_HAL_SPI_INTERRUPT_RX    (1UL << 1U)
#define GD32_HAL_SPI_INTERRUPT_ERROR (1UL << 2U)

typedef struct
{
    uint8_t master;
    uint8_t direction;
    uint8_t data_bits;
    uint8_t clock_polarity_high;
    uint8_t clock_phase_second;
    uint8_t nss;
    uint16_t prescaler;
    uint8_t lsb_first;
    uint8_t ti_mode;
    uint8_t crc_enable;
    uint16_t crc_polynomial;
} GD32_HAL_SPIConfig;

typedef enum
{
    GD32_HAL_ADC_TRIGGER_SOFTWARE = 0,
    GD32_HAL_ADC_TRIGGER_TIMER0_CH0,
    GD32_HAL_ADC_TRIGGER_TIMER0_CH1,
    GD32_HAL_ADC_TRIGGER_TIMER0_CH2,
    GD32_HAL_ADC_TRIGGER_TIMER1_CH1,
    GD32_HAL_ADC_TRIGGER_TIMER2_TRGO,
    GD32_HAL_ADC_TRIGGER_TIMER3_CH3,
    GD32_HAL_ADC_TRIGGER_TIMER7_TRGO,
    GD32_HAL_ADC_TRIGGER_EXTI11
} GD32_HAL_ADCTrigger;

typedef enum
{
    GD32_HAL_ADC_FLAG_EOC = (1UL << 0U),
    GD32_HAL_ADC_FLAG_OVERRUN_UNAVAILABLE = (1UL << 1U)
} GD32_HAL_ADCFlag;

typedef enum
{
    GD32_HAL_ADC_INTERRUPT_EOC = (1UL << 0U),
    GD32_HAL_ADC_INTERRUPT_OVERRUN_UNAVAILABLE = (1UL << 1U)
} GD32_HAL_ADCInterrupt;

typedef struct
{
    uint8_t clock_divider;
    uint8_t resolution_bits;
    uint8_t align_left;
    uint8_t scan;
    uint8_t continuous;
    uint8_t discontinuous;
    uint8_t discontinuous_count;
    uint8_t sequence_length;
    GD32_HAL_ADCTrigger trigger;
} GD32_HAL_ADCConfig;

typedef enum
{
    GD32_HAL_TIMER_ALIGNMENT_EDGE = 0,
    GD32_HAL_TIMER_ALIGNMENT_CENTER_DOWN,
    GD32_HAL_TIMER_ALIGNMENT_CENTER_UP,
    GD32_HAL_TIMER_ALIGNMENT_CENTER_BOTH
} GD32_HAL_TIMERAlignment;

